app/views/product_rental/add_items.html.erb

        <tr>
          <td><%= f.collection_select(:product_id, Product.all, :id, :name)%></td>
---
SELECT "products".* FROM "products"