app/views/product_rental/new.html.erb

      <div class="grid_2">
        <%= f.collection_select(:member_id, Member.all, :id, :id) %>
---
SELECT "members".* FROM "members"