app/views/product_rental/view_receipt.html.erb

      <tbody>
      <% @product_rental.product_rental_items.each do |item| %>
---
SELECT "product_rental_items".* FROM "product_rental_items"  WHERE "product_rental_items"."product_rental_id" = ?  [["product_rental_id", 5]]