app/views/system_booking/due_today.html.erb

                <td><%= sys.id %></td>
                <td><%= sys.member.first_name + ' ' + sys.member.surname %></td>
---
SELECT  "members".* FROM "members"  WHERE "members"."id" = ? LIMIT 1  [["id", 8]]