app/views/system_booking/edit.html.erb

SELECT "members".* FROM "members"
---
      <div class="grid_2">
        <%= f.collection_select(:member_id, Member.all, :id, :id) %>

SELECT "systems".* FROM "systems"
---
      <div class="grid_2 margins-bottom">
        <%= f.collection_select(:system_id, System.all, :id, :description) %>