app/views/system_booking/new.html.erb

      <div class="grid_2">
        <%= f.collection_select(:member_id, Member.all, :id, :id) %>
---
SELECT "members".* FROM "members"

      <div class="grid_2 margins-bottom">
        <%= f.collection_select(:system_id, System.all, :id, :description) %>
---
SELECT "systems".* FROM "systems"