app/views/product/new.html.erb

SELECT "product_types".* FROM "product_types"
---
        <div class="grid_2 margins-bottom">
            <%= f.collection_select(:product_type_id,ProductType.all, :id, :easy_name) %>