app/controllers/member_type_controller.rb

SELECT "member_types".* FROM "member_types"
SELECT COUNT(*) FROM "member_types"
---
  def view
    if MemberType.any?

SELECT  "member_types".* FROM "member_types"  WHERE "member_types"."id" = ? LIMIT 1  [["id", 0]]
---
  def edit
    if params[:id]
      begin
        @member_type = MemberType.find(params[:id])

SELECT  "member_types".* FROM "member_types"  WHERE "member_types"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "member_types" WHERE "member_types"."id" = ?  [["id", 7]]
---
  def delete
    begin
      @member_type = MemberType.find(params[:id])
    rescue ActiveRecord::RecordNotFound
      flash[:error] = 'User not found'
      redirect_to :action => 'view'
    end
    @member_type.destroy!

INSERT INTO "member_types" ("created_at", "easy_name", "price", "requires_previous", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-06-02 09:39:47.568720"], ["easy_name", "INSAAANE"], ["price", 1000000.0], ["requires_previous", "t"], ["updated_at", "2015-06-02 09:39:47.568720"]]
---
  def process_new
    @member_type = MemberType.new(member_type_params)
    if @member_type.save()

SELECT  "member_types".* FROM "member_types"  WHERE "member_types"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "member_types" SET "price" = ?, "updated_at" = ? WHERE "member_types"."id" = 6  [["price", 10000001.0], ["updated_at", "2015-06-02 09:51:21.022009"]]
---
  def process_edit
    @member_type = MemberType.find(params[:id])
    if @member_type.update_attributes(member_type_params)