app/controllers/member_controller.rb

  def view
    if Member.any?
---
SELECT "members".* FROM "members"
SELECT COUNT(*) FROM "members"

  def edit
    if params[:id]
      begin
        @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members"  WHERE "members"."id" = ? LIMIT 1  [["id", 8]]

  def delete
    begin
      @member = Member.find(params[:id])
    rescue ActiveRecord::RecordNotFound
      flash[:error] = 'User not found'
      redirect_to :action => 'view'
    end
    @member.destroy!
---
SELECT  "members".* FROM "members"  WHERE "members"."id" = ? LIMIT 1  [["id", 35]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 35]]

  def process_new
    @member = Member.new(member_params)
    @member.member_type_id=0
    if @member.save()
---
INSERT INTO "members" ("contact_no", "created_at", "date_of_birth", "first_name", "house_no", "member_type_id", "postcode", "street_name", "surname", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def process_edit
    @member = Member.find(params[:id])
    if @member.update_attributes(member_params)
---
SELECT  "members".* FROM "members"  WHERE "members"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "members" SET "postcode" = ?, "updated_at" = ? WHERE "members"."id" = 8  [["postcode", "Different Postcode"], ["updated_at", "2015-06-02 09:21:55.736684"]]