app/controllers/product_controller.rb

SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "products"
---
  def view
    if Product.any?

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 33]]
---
  def edit
    if params[:id]
      begin
        @product = Product.find(params[:id])

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 22]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 22]]
---
  def delete
    begin
      @product = Product.find(params[:id])
    rescue ActiveRecord::RecordNotFound
      flash[:error] = 'User not found'
      redirect_to :action => 'view'
    end
    @product.destroy!

INSERT INTO "products" ("age_rating", "created_at", "imdb_id", "name", "product_type_id", "star_rating", "synopsis", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def process_new
    @product = Product.new(product_params)
    if @product.save()

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 33]]
UPDATE "products" SET "star_rating" = ?, "synopsis" = ?, "updated_at" = ? WHERE "products"."id" = 36  [["star_rating", 8.0], ["synopsis", "THIS IS A MIC CHECK\r\nwob wob wobba wobba wob wob"], ["updated_at", "2015-06-04 18:32:02.956974"]]
---
  def process_edit
    @product = Product.find(params[:id])
    if @product.update_attributes(product_params)