app/controllers/product_rental_controller.rb

SELECT "product_rentals".* FROM "product_rentals"
SELECT COUNT(*) FROM "product_rentals"
---
  def view
    if ProductRental.any?

SELECT  "product_rentals".* FROM "product_rentals"  WHERE "product_rentals"."id" = ? LIMIT 1  [["id", 5]]
---
  def view_receipt
    if params[:id]
      @product_rental = ProductRental.find(params[:id])

SELECT "product_rentals".* FROM "product_rentals"  WHERE (returned = 0 AND due_date > '2015-06-02')
---
  def view_overdue
    @product_rentals = ProductRental.where('returned = 0 AND due_date > :today',today: Date.today)

SELECT  "product_rentals".* FROM "product_rentals"  WHERE "product_rentals"."id" = ? LIMIT 1  [["id", 5]]
---
  def return
    @product_rental = ProductRental.find(params[:id])

SELECT  "product_rentals".* FROM "product_rentals"  WHERE "product_rentals"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "product_rentals" WHERE "product_rentals"."id" = ?  [["id", 4]]
---
  def delete
    begin
      @product_rental = ProductRental.find(params[:id])
    rescue ActiveRecord::RecordNotFound
      flash[:error] = 'User not found'
      redirect_to :action => 'view'
    end
    @product_rental.destroy!

INSERT INTO "product_rentals" ("created_at", "due_date", "late_fees", "member_id", "returned", "start_date", "total_price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def process_new
    @product_rental = ProductRental.new(product_rental_params)
    @product_rental.total_price = 0
    @product_rental.late_fees = 0
    @product_rental.returned = false
    if @product_rental.save()

SELECT  "product_rentals".* FROM "product_rentals"  WHERE "product_rentals"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "product_rental_items" ("created_at", "product_id", "product_rental_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-06-02 15:55:24.900885"], ["product_id", 0], ["product_rental_id", 2], ["updated_at", "2015-06-02 15:55:24.900885"]]
UPDATE "product_rentals" SET "total_price" = ?, "updated_at" = ? WHERE "product_rentals"."id" = 5  [["total_price", 4.0], ["updated_at", "2015-06-02 16:11:23.287891"]]
---
  def add_items
    @product_rental = ProductRental.find(params[:id])
    if @product_rental.product_rental_items
      puts 'Im heeere'
      @rental_items = @product_rental.product_rental_items
    else
      @rental_items = nil
    end
    if params[:product_rental_item]
      @rental_item = ProductRentalItem.new(product_rental_item_params)
      @rental_item.product_rental_id = @product_rental.id
      if @rental_item.valid? and params[:commit] == 'Add More'
        @product_rental.total_price += @rental_item.product.product_type.price * @product_rental.duration
        @rental_item.save
        @product_rental.save