app/controllers/product_type_controller.rb

SELECT "product_types".* FROM "product_types"
SELECT COUNT(*) FROM "product_types"
---
  def view
    if ProductType.any?

SELECT  "product_types".* FROM "product_types"  WHERE "product_types"."id" = ? LIMIT 1  [["id", 0]]
---
  def edit
    if params[:id]
      begin
        @product_type = ProductType.find(params[:id])

SELECT  "product_types".* FROM "product_types"  WHERE "product_types"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "product_types" WHERE "product_types"."id" = ?  [["id", 7]]
---
  def delete
    begin
      @product_type = ProductType.find(params[:id])
    rescue ActiveRecord::RecordNotFound
      flash[:error] = 'User not found'
      redirect_to :action => 'view'
    end
    @product_type.destroy!

INSERT INTO "product_types" ("created_at", "easy_name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-06-02 10:32:46.979011"], ["easy_name", "Test Type"], ["price", 50.0], ["updated_at", "2015-06-02 10:32:46.979011"]]
---
  def process_new
    @product_type = ProductType.new(product_type_params)
    if @product_type.save()

SELECT  "product_types".* FROM "product_types"  WHERE "product_types"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "product_types" SET "easy_name" = ?, "updated_at" = ? WHERE "product_types"."id" = 0  [["easy_name", "DVD - Edited"], ["updated_at", "2015-06-02 10:37:16.640122"]]
---
  def process_edit
    @product_type = ProductType.find(params[:id])
    if @product_type.update_attributes(product_type_params)