app/controllers/system_controller.rb

  def view
    if System.any?
---
SELECT "systems".* FROM "systems"
SELECT COUNT(*) FROM "systems"

  def edit
    if params[:id]
      begin
        @system = System.find(params[:id])
---
SELECT  "systems".* FROM "systems"  WHERE "systems"."id" = ? LIMIT 1  [["id", 96]]

  def delete
    begin
      @system = System.find(params[:id])
    rescue ActiveRecord::RecordNotFound
      flash[:error] = 'User not found'
      redirect_to :action => 'view'
    end
    @system.destroy!
---
SELECT  "systems".* FROM "systems"  WHERE "systems"."id" = ? LIMIT 1  [["id", 80]]
DELETE FROM "systems" WHERE "systems"."id" = ?  [["id", 80]]

  def process_new
    @system = System.new(system_params)
    if @system.save()
---
INSERT INTO "systems" ("audio_setup", "base_price", "created_at", "description", "hd", "three_d", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def process_edit
    @system = System.find(params[:id])
---
SELECT  "systems".* FROM "systems"  WHERE "systems"."id" = ? LIMIT 1  [["id", 96]]