app/controllers/system_booking_controller.rb

SELECT "system_bookings".* FROM "system_bookings"
SELECT COUNT(*) FROM "system_bookings"
---
  def view
    if SystemBooking.any?

SELECT  "system_bookings".* FROM "system_bookings"  WHERE "system_bookings"."id" = ? LIMIT 1  [["id", 1]]
---
  def view_receipt
    if params[:id]
      @system_booking = SystemBooking.find(params[:id])

SELECT  "system_bookings".* FROM "system_bookings"  WHERE "system_bookings"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    if params[:id]
      begin
        @system_booking = SystemBooking.find(params[:id])

SELECT  "system_bookings".* FROM "system_bookings"  WHERE "system_bookings"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "system_bookings" WHERE "system_bookings"."id" = ?  [["id", 2]]
---
  def delete
    begin
      @system_booking = SystemBooking.find(params[:id])
    rescue ActiveRecord::RecordNotFound
      flash[:error] = 'User not found'
      redirect_to :action => 'view'
    end
    @system_booking.destroy!

INSERT INTO "system_bookings" ("collection_date", "created_at", "deposit_paid", "member_id", "system_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["collection_date", "2015-06-08"], ["created_at", "2015-06-04 19:14:21.455775"], ["deposit_paid", "f"], ["member_id", 8], ["system_id", 0], ["updated_at", "2015-06-04 19:14:21.455775"]]
---
  def process_new
    @system_booking = SystemBooking.new(system_booking_params)
    if @system_booking.save()

SELECT "system_bookings".* FROM "system_bookings"  WHERE (install_date >= '2015-06-02' AND system_id = 0 AND id <> 1)
UPDATE "system_bookings" SET "system_id" = ?, "total_cost" = ?, "updated_at" = ? WHERE "system_bookings"."id" = 1  [["system_id", 11], ["total_cost", 120.0], ["updated_at", "2015-06-02 13:33:26.724239"]]
---
  def process_edit
    @system_booking = SystemBooking.find(params[:id])
    if @system_booking.update_attributes(system_booking_params)